app/views/loans/_form.html.erb

    <%= form_for(@loan) do |f| %>
      <%= f.collection_select(:book_id, Book.all, :id, :title)  %>

      <%= f.collection_select(:student_id, Student.all, :id, :name)  %>
---
SELECT "books".* FROM "books"
SELECT "students".* FROM "students"