app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
  def index
    @admins = Admin.all

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "admins" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "Adm"], ["email", "adm2019@gmail.com"], ["password_digest", "$2a$10$T6b/crkolJ3gyAaZ3nyuZurfAqauTK0HXUc901hrVz32PcMhJOAiC"], ["updated_at", "2018-05-21 17:30:34.002804"], ["id", 13]]
---
  def update
    @admin = Admin.find(params[:id])
    if @admin.update_attributes(admin_params)

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def edit
    @admin = Admin.find(params[:id])