app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @quantity_books = Book.count
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params[:id])

INSERT INTO "books" ("title", "genre", "number_page", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Três Porquinhos"], ["genre", "Infantil"], ["number_page", 14], ["year", 1990], ["created_at", "2018-05-17 23:41:12.267518"], ["updated_at", "2018-05-17 23:41:12.267518"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def destroy
      Book.find(params[:id]).destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "number_page" = ?, "year" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Alice no Pais das Maravilhas"], ["author", "Mario Quintana"], ["number_page", 20], ["year", 2000], ["updated_at", "2018-05-18 03:30:55.354941"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update_attributes(book_params)