app/controllers/librariers_controller.rb

SELECT  "librariers".* FROM "librariers" WHERE "librariers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @librarier = Librarier.find(params[:id])

SELECT "librariers".* FROM "librariers"
---
  def index
    @librariers = Librarier.all

SELECT  "librariers".* FROM "librariers" WHERE "librariers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @librarier = Librarier.find(params[:id])

DELETE FROM "librariers" WHERE "librariers"."id" = ?  [["id", 21]]
SELECT  "librariers".* FROM "librariers" WHERE "librariers"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
    def destroy
    Librarier.find(params[:id]).destroy

INSERT INTO "librariers" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lucas"], ["email", "lclucasgr@gmail.com"], ["password", "palmeiras2019"], ["created_at", "2018-05-07 14:32:30.482073"], ["updated_at", "2018-05-07 14:32:30.482073"]]
---
  def create
    @librarier = Librarier.new(librarier_params)
    if @librarier.save

SELECT  "librariers".* FROM "librariers" WHERE "librariers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "librariers" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "librariers"."id" = ?  [["name", "Roberto"], ["email", "roberto@gmail.com"], ["password_digest", "$2a$10$nA.UPYiTFhHXb8TyvXN4HOxckWtM0nhWi2hxIO2KMwBGmjsOu8Jfu"], ["updated_at", "2018-05-18 03:29:31.089532"], ["id", 29]]
---
  def update
    @librarier = Librarier.find(params[:id])
    if @librarier.update_attributes(librarier_params)