app/controllers/loans_controller.rb

  def index
  	@loans = Loan.all;
---
SELECT "loans".* FROM "loans"

  def create
    @loan = Loan.new(loan_params)

    if @loan.save
---
INSERT INTO "loans" ("student_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["book_id", 2], ["created_at", "2018-06-04 01:45:29.075515"], ["updated_at", "2018-06-04 01:45:29.075515"]]

  def new
  	@loan = Loan.new;
    @books = Book.where(disponivel: true)
---
SELECT "books".* FROM "books" WHERE "books"."disponivel" = ?  [["disponivel", "t"]]

  def edit
    @loan = Loan.find(params[:id])
---
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    Loan.find(params[:id]).destroy
---
DELETE FROM "loans" WHERE "loans"."id" = ?  [["id", 2]]
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @loan = Loan.find(params[:id])
    if @loan.update_attributes(loan_params)
---
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "loans" SET "book_id" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["book_id", 4], ["updated_at", "2018-06-04 01:47:43.426179"], ["id", 1]]