app/controllers/sessions_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
---
  def create
    admin = Admin.find_by(email: params[:session][:email].downcase)

SELECT  "librariers".* FROM "librariers" WHERE "librariers"."email" = ? LIMIT ?  [["email", "librarier2019@gmail.com"], ["LIMIT", 1]]
---
  def login
    librarier = Librarier.find_by(email: params[:session][:email].downcase)