app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @student = Student.find(params[:id])

INSERT INTO "students" ("name", "email", "turma", "celular", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Lucas"], ["email", "lclucasgr@gmail.com"], ["turma", "7A"], ["celular", "(42)4403-1051"], ["created_at", "2018-05-18 20:31:54.976710"], ["updated_at", "2018-05-18 20:31:54.976710"]]
---
  def create
    @student = Student.new(student_params)
    if @student.save

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def destroy
      Student.find(params[:id]).destroy

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "email" = ?, "turma" = ?, "celular" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "João"], ["email", "joao@yahoo.com"], ["turma", "2A"], ["celular", "(42)8826-8802"], ["updated_at", "2018-05-19 00:06:10.761363"], ["id", 3]]
---
  def update
    @student = Student.find(params[:id])
    if @student.update_attributes(student_params)